joristork/robots/jobot_in_c/microchip_extras/h/p18f85k90.h
extern volatile near unsigned char       PORTC;
extern volatile near union {
  struct {
    unsigned RC0:1;
    unsigned RC1:1;
    unsigned RC2:1;
    unsigned RC3:1;
    unsigned RC4:1;
    unsigned RC5:1;
    unsigned RC6:1;
    unsigned RC7:1;
  };
  struct {
    unsigned :1;
    unsigned SEG32:1;
    unsigned SEG13:1;
    unsigned SEG17:1;
    unsigned SEG16:1;
    unsigned SEG12:1;
    unsigned SEG27:1;
    unsigned SEG28:1;
  };
  struct {
    unsigned SOSCO:1;
    unsigned SOSCI:1;
    unsigned :1;
    unsigned SCK1:1;
    unsigned SDI1:1;
    unsigned SDO1:1;
    unsigned TX1:1;
    unsigned RX1:1;
  };
  struct {
    unsigned SCKLI:1;
    unsigned CCP2:1;
    unsigned CCP1:1;
    unsigned SCL1:1;
    unsigned SDA1:1;
    unsigned :1;
    unsigned CK1:1;
    unsigned DT1:1;
  };
  struct {
    unsigned :1;
    unsigned PA2:1;
    unsigned PA1:1;
  };
} PORTCbits;
extern volatile near unsigned char       PORTD;
extern volatile near union {
  struct {
    unsigned RD0:1;
    unsigned RD1:1;
    unsigned RD2:1;
    unsigned RD3:1;
    unsigned RD4:1;
    unsigned RD5:1;
    unsigned RD6:1;
    unsigned RD7:1;
  };
  struct {
    unsigned AD0:1;
    unsigned AD1:1;
    unsigned AD2:1;
    unsigned AD3:1;
    unsigned AD4:1;
    unsigned AD5:1;
    unsigned AD6:1;
    unsigned AD7:1;
  };
  struct {
    unsigned PSP0:1;
    unsigned PSP1:1;
    unsigned PSP2:1;
    unsigned PSP3:1;
    unsigned PSP4:1;
    unsigned PSP5:1;
    unsigned PSP6:1;
    unsigned PSP7:1;
  };
  struct {
    unsigned SEG0:1;
    unsigned SEG1:1;
    unsigned SEG2:1;
    unsigned SEG3:1;
    unsigned SEG4:1;
    unsigned SEG5:1;
    unsigned SEG6:1;
    unsigned SEG7:1;
  };
  struct {
    unsigned CTPLS:1;
    unsigned T5CKI:1;
    unsigned :2;
    unsigned SDO2:1;
    unsigned SDI2:1;
    unsigned SCK2:1;
    unsigned SS2:1;
  };
  struct {
    unsigned :1;
    unsigned T7G:1;
    unsigned :3;
    unsigned SDA2:1;
    unsigned SCL2:1;
  };
} PORTDbits;
extern volatile near unsigned char       PORTE;
extern volatile near union {
  struct {
    unsigned RE0:1;
    unsigned RE1:1;
    unsigned RE2:1;
    unsigned RE3:1;
    unsigned RE4:1;
    unsigned RE5:1;
    unsigned RE6:1;
    unsigned RE7:1;
  };
  struct {
    unsigned AD8:1;
    unsigned AD9:1;
    unsigned AD10:1;
    unsigned AD11:1;
    unsigned AD12:1;
    unsigned AD13:1;
    unsigned AD14:1;
    unsigned AD15:1;
  };
  struct {
    unsigned PD2:1;
    unsigned PC2:1;
    unsigned PB2:1;
    unsigned PC3:1;
    unsigned PB3:1;
    unsigned PC1:1;
    unsigned PB1:1;
    unsigned PA2:1;
  };
  struct {
    unsigned :2;
    unsigned CCP10:1;
    unsigned CCP9:1;
    unsigned CCP8:1;
    unsigned CCP7:1;
    unsigned CCP6:1;
    unsigned CCP2:1;
  };
  struct {
    unsigned RD:1;
    unsigned WR:1;
    unsigned CS:1;
    unsigned COM0:1;
    unsigned COM1:1;
    unsigned COM2:1;
    unsigned COM3:1;
    unsigned SEG31:1;
  };
  struct {
    unsigned LCDBIAS1:1;
    unsigned LCDBIAS2:1;
    unsigned LCDBIAS3:1;
    unsigned :1;
    unsigned REFO:1;
  };
} PORTEbits;
extern volatile near unsigned char       PORTF;
extern volatile near union {
  struct {
    unsigned :1;
    unsigned RF1:1;
    unsigned RF2:1;
    unsigned RF3:1;
    unsigned RF4:1;
    unsigned RF5:1;
    unsigned RF6:1;
    unsigned RF7:1;
  };
  struct {
    unsigned :1;
    unsigned AN6:1;
    unsigned AN7:1;
    unsigned AN8:1;
    unsigned AN9:1;
    unsigned AN10:1;
    unsigned AN11:1;
    unsigned AN5:1;
  };
  struct {
    unsigned :1;
    unsigned SEG19:1;
    unsigned SEG20:1;
    unsigned SEG21:1;
    unsigned SEG22:1;
    unsigned SEG23:1;
    unsigned SEG24:1;
    unsigned SEG25:1;
  };
  struct {
    unsigned :1;
    unsigned C2OUT:1;
    unsigned C1OUT:1;
    unsigned C2INB:1;
    unsigned C2INA:1;
    unsigned C1INB:1;
    unsigned C1INA:1;
    unsigned SS1:1;
  };
  struct {
    unsigned :1;
    unsigned CTDIN:1;
    unsigned :1;
    unsigned CTMUI:1;
    unsigned :1;
    unsigned CVREF:1;
  };
} PORTFbits;
extern volatile near unsigned char       PORTG;
extern volatile near union {
  struct {
    unsigned RG0:1;
    unsigned RG1:1;
    unsigned RG2:1;
    unsigned RG3:1;
    unsigned RG4:1;
    unsigned RG5:1;
  };
  struct {
    unsigned CCP3:1;
    unsigned C3OUT:1;
    unsigned C3INA:1;
    unsigned C3INB:1;
    unsigned C3INC:1;
  };
  struct {
    unsigned PA3:1;
    unsigned TX2:1;
    unsigned RX2:1;
    unsigned PD3:1;
    unsigned PD1:1;
  };
  struct {
    unsigned :1;
    unsigned AN19:1;
    unsigned AN18:1;
    unsigned AN17:1;
    unsigned AN16:1;
  };
  struct {
    unsigned :1;
    unsigned CK2:1;
    unsigned DT2:1;
    unsigned CCP4:1;
    unsigned CCP5:1;
  };
  struct {
    unsigned :4;
    unsigned SEG26:1;
  };
  struct {
    unsigned :4;
    unsigned T7CKI:1;
  };
  struct {
    unsigned :4;
    unsigned T5G:1;
  };
  struct {
    unsigned :4;
    unsigned RTCC:1;
  };
} PORTGbits;
extern volatile near unsigned char       PORTH;
extern volatile near union {
  struct {
    unsigned RH0:1;
    unsigned RH1:1;
    unsigned RH2:1;
    unsigned RH3:1;
    unsigned RH4:1;
    unsigned RH5:1;
    unsigned RH6:1;
    unsigned RH7:1;
  };
  struct {
    unsigned SEG47:1;
    unsigned SEG46:1;
    unsigned SEG45:1;
    unsigned SEG44:1;
    unsigned SEG40:1;
    unsigned SEG41:1;
    unsigned SEG42:1;
    unsigned SEG43:1;
  };
  struct {
    unsigned AN23:1;
    unsigned AN22:1;
    unsigned AN21:1;
    unsigned AN20:1;
    unsigned AN12:1;
    unsigned AN13:1;
    unsigned AN14:1;
    unsigned AN15:1;
  };
  struct {
    unsigned A16:1;
    unsigned A17:1;
    unsigned A18:1;
    unsigned A19:1;
    unsigned CCP9:1;
    unsigned CCP8:1;
    unsigned CCP7:1;
    unsigned CCP6:1;
  };
  struct {
    unsigned :4;
    unsigned PC3:1;
    unsigned PB3:1;
    unsigned PC1:1;
    unsigned PB1:1;
  };
  struct {
    unsigned :4;
    unsigned C2INC:1;
    unsigned C2IND:1;
    unsigned C1INC:1;
  };
} PORTHbits;
extern volatile near unsigned char       PORTJ;
extern volatile near union {
  struct {
    unsigned RJ0:1;
    unsigned RJ1:1;
    unsigned RJ2:1;
    unsigned RJ3:1;
    unsigned RJ4:1;
    unsigned RJ5:1;
    unsigned RJ6:1;
    unsigned RJ7:1;
  };
  struct {
    unsigned ALE:1;
    unsigned OE:1;
    unsigned WRL:1;
    unsigned WRH:1;
    unsigned BA0:1;
    unsigned CE:1;
    unsigned LB:1;
    unsigned UB:1;
  };
  struct {
    unsigned :1;
    unsigned SEG33:1;
    unsigned SEG34:1;
    unsigned SEG35:1;
    unsigned SEG39:1;
    unsigned SEG38:1;
    unsigned SEG37:1;
    unsigned SEG36:1;
  };
} PORTJbits;
